Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesNonSlabSources Property
 Some sources of a volume divider are non-slab like.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesNonSlabSources { get; }
Public Shared ReadOnly Property DivideVolumesProfilesNonSlabSources As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesNonSlabSources {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesNonSlabSources : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace